
Q1. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series.

In [2]:
import pandas as pd
l1=[4,8,15,16,23,42];
df=pd.Series(l1)

In [3]:
df

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the
variable print it.

In [9]:
l1=range(1,11)

In [10]:
for i in l1:
    print(i)

1
2
3
4
5
6
7
8
9
10

In [11]:
df2=pd.Series(l1)

In [12]:
df2

0     1
1     2
2     3
3     4
4     5
5     6
6     7
7     8
8     9
9    10
dtype: int64

Q3. Create a Pandas DataFrame that contains the following data: Then, print the DataFrame.

In [13]:
data={"Name":['Alice','Bob','Charlie'],
      "Age":[25,30,27],
      "Gender":['Female','Male','Female']
}

In [14]:
data

{'Name': ['Alice', 'Bob', 'Charlie'],
 'Age': [25, 30, 27],
 'Gender': ['Female', 'Male', 'Female']}

In [15]:
df3=pd.DataFrame(data)

In [16]:
df3

      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   27  Female

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Answer:
Series is a one dimensional array which can store only a single data type.Once Series is created the size cant be mutable.
DataFrame is a two dimensional array which can store different types of data type element . Once created the size is mutable.

In [17]:
series1=pd.Series([1,2,3,4,5])

In [18]:
series1

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [19]:
series1.dtypes

dtype('int64')

In [20]:
data1={"a":[1,2,3],
      "b":[4,5,6],
      "c":[7,8,9]}

In [21]:
data1

{'a': [1, 2, 3], 'b': [4, 5, 6], 'c': [7, 8, 9]}

In [22]:
df4=pd.DataFrame(data1)

In [23]:
df4

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can
you give an example of when you might use one of these functions?

In [24]:
# describe => means to give some statistical value like mean, 25%,50% and 75% etc.
df4.describe()

         a    b    c
count  3.0  3.0  3.0
mean   2.0  5.0  8.0
std    1.0  1.0  1.0
min    1.0  4.0  7.0
25%    1.5  4.5  7.5
50%    2.0  5.0  8.0
75%    2.5  5.5  8.5
max    3.0  6.0  9.0

In [30]:
# this is to give some start row 
df4.head()

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

In [28]:
df4[df4['a']>=df4['a'].mean()]

   a  b  c
1  2  5  8
2  3  6  9

In [31]:
df4.tail()

   a  b  c
0  1  4  7
1  2  5  8
2  3  6  9

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Answer:
Series is not size mutable but the values are mutable.
DataFrame is size mutable and also the values are mutable.
Panel is also size mutable and values of the panel are mutable.

Q7. Create a DataFrame using multiple Series. Explain with an example.

In [36]:
s1=pd.Series([1,2,3,4]);
s2=pd.Series([5,6,7,8]);
s3=pd.Series([9,"Name",11,12]);

In [37]:
df4=pd.DataFrame([s1,s2,s3])

In [38]:
df4

   0     1   2   3
0  1     2   3   4
1  5     6   7   8
2  9  Name  11  12